---
kind: other
id: Methods.T:Autodesk.Revit.DB.RepeaterBounds
source: html/73c72474-82b7-c550-0364-1f630356ccec.htm
---
# RepeaterBounds Methods

Shifts the input coordinates in the cyclical dimensions so that they fall in the [lower bounds, upper bounds] range.